#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/maxfrise/maxfrise-infra/runs/run-75HFmdh1e5w1RA18

Waiting for the plan to start...

Terraform v1.4.2
on linux_amd64
Initializing plugins and modules...
module.agencies_lambda.data.archive_file.agencies_source: Refreshing...
module.agencies_lambda.data.archive_file.agencies_source: Refresh complete after 0s [id=0035f2a418841c5fc85e85e43105b01c64b6894d]
module.agencies_lambda.aws_s3_object.agencies_s3_bucket: Refreshing state... [id=agencies_lambda.zip]
module.iam_maxfrise_lambdas.aws_iam_role.iam_maxfrise_lambdas: Refreshing state... [id=iam_maxfrise_lambdas]
module.maxfrise_api_gateway.aws_api_gateway_rest_api.maxfrise_api: Refreshing state... [id=8hbmj9nmrj]
module.dynamoDB_agencies_prod_table.aws_dynamodb_table.agencies_prod: Refreshing state... [id=agencies-prod-table]
module.dynamoDB_agencies_test_table.aws_dynamodb_table.agencies_test: Refreshing state... [id=agencies-test-table]
module.agencies_lambda.aws_lambda_function.agencies_lambda: Refreshing state... [id=agencies-lambda]
module.agencies_lambda.aws_lambda_function.agencies_lambda: Drift detected (update)
module.agencies_lambda.aws_s3_object.agencies_s3_bucket: Drift detected (update)
module.iam_maxfrise_lambdas.aws_iam_role.iam_maxfrise_lambdas: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.agencies_lambda.aws_lambda_function.agencies_lambda must be replaced
+/- resource "aws_lambda_function" "agencies_lambda" {
      ~ arn                            = "arn:aws:lambda:us-west-2:914036813947:function:agencies-lambda" -> (known after apply)
      ~ function_name                  = "agencies-lambda" -> "agencies_lambda" # forces replacement
      ~ id                             = "agencies-lambda" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:914036813947:function:agencies-lambda/invocations" -> (known after apply)
      ~ last_modified                  = "2023-06-27T04:04:57.116+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:914036813947:function:agencies-lambda:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:914036813947:function:agencies-lambda:$LATEST/invocations" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_size               = 521 -> (known after apply)
      - tags                           = {} -> null
      ~ tags_all                       = {} -> (known after apply)
      ~ version                        = "$LATEST" -> (known after apply)
        # (14 unchanged attributes hidden)

      - ephemeral_storage {
          - size = 512 -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.maxfrise_api_gateway.aws_api_gateway_deployment.api_prod_deployment will be created
  + resource "aws_api_gateway_deployment" "api_prod_deployment" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "8hbmj9nmrj"
      + triggers      = (known after apply)
    }

  # module.maxfrise_api_gateway.aws_api_gateway_deployment.api_test_deployment will be created
  + resource "aws_api_gateway_deployment" "api_test_deployment" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "8hbmj9nmrj"
      + triggers      = (known after apply)
    }

  # module.maxfrise_api_gateway.aws_api_gateway_integration.agencies_lambda_integration will be created
  + resource "aws_api_gateway_integration" "agencies_lambda_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = "8hbmj9nmrj"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.maxfrise_api_gateway.aws_api_gateway_method.agencies_resource_method will be created
  + resource "aws_api_gateway_method" "agencies_resource_method" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = "8hbmj9nmrj"
    }

  # module.maxfrise_api_gateway.aws_api_gateway_resource.agencies_resource will be created
  + resource "aws_api_gateway_resource" "agencies_resource" {
      + id          = (known after apply)
      + parent_id   = "l430g22nc3"
      + path        = (known after apply)
      + path_part   = "agencies"
      + rest_api_id = "8hbmj9nmrj"
    }

  # module.maxfrise_api_gateway.aws_api_gateway_stage.prod will be created
  + resource "aws_api_gateway_stage" "prod" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "8hbmj9nmrj"
      + stage_name    = "prod"
      + tags_all      = (known after apply)
      + variables     = {
          + "environment" = "prod"
        }
      + web_acl_arn   = (known after apply)
    }

  # module.maxfrise_api_gateway.aws_api_gateway_stage.test will be created
  + resource "aws_api_gateway_stage" "test" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "8hbmj9nmrj"
      + stage_name    = "test"
      + tags_all      = (known after apply)
      + variables     = {
          + "environment" = "test"
        }
      + web_acl_arn   = (known after apply)
    }

  # module.maxfrise_api_gateway.aws_lambda_permission.agencies_api_lambda_permission will be created
  + resource "aws_lambda_permission" "agencies_api_lambda_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "agencies_lambda"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:us-west-2:914036813947:8hbmj9nmrj/*"
      + statement_id        = "AllowExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

Plan: 9 to add, 0 to change, 1 to destroy.

```

</details>

*Pushed by: @inavac182, Action: `pull_request`*